// Реализовать абстрактный класс Warrior, с полями name, weapon, healthPoint
// Создать интерфейс Weapon с методом damage(), который будет показывать наносимый урон
// На основе класса Warrior создать различные типы воинов, например, лучник, меченосец, 
// ополченец и т.п. У лучника добавить поле расстояние поражения. 
// Создать различные виды вооружения, например, меч, лук, лопата. 
// Обеспечить, чтобы определенный тип воина мог нести только определенной оружие
// Создать класс командира



package sems.sem4;

public class Main {
    
}
